{
  "architectures": [
    "Qwen3_5ForConditionalGeneration"
  ],
  "model_type": "qwen3_5",
  "_name_or_path": "Qwen/Qwen3.5-27B",
  "transformers_version": "5.4.0",
  "tie_word_embeddings": false,
  "image_token_id": 248056,
  "video_token_id": 248057,
  "vision_start_token_id": 248053,
  "vision_end_token_id": 248054,
  "vision_config": {
    "model_type": "qwen3_5",
    "depth": 27,
    "hidden_size": 1152,
    "hidden_act": "gelu_pytorch_tanh",
    "intermediate_size": 4304,
    "num_heads": 16,
    "in_channels": 3,
    "patch_size": 16,
    "spatial_merge_size": 2,
    "temporal_patch_size": 2,
    "out_hidden_size": 5120,
    "num_position_embeddings": 2304,
    "initializer_range": 0.02
  },
  "text_config": {
    "model_type": "qwen3_5_text",
    "vocab_size": 248320,
    "hidden_size": 5120,
    "intermediate_size": 17408,
    "num_hidden_layers": 64,
    "num_attention_heads": 24,
    "num_key_value_heads": 4,
    "head_dim": 256,
    "hidden_act": "silu",
    "max_position_embeddings": 262144,
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-06,
    "use_cache": true,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "dtype": "bfloat16",
    "tie_word_embeddings": false,
    "attn_output_gate": true,
    "full_attention_interval": 4,
    "mlp_only_layers": [],
    "mtp_num_hidden_layers": 1,
    "mtp_use_dedicated_embeddings": false,
    "mamba_ssm_dtype": "float32",
    "partial_rotary_factor": 0.25,
    "linear_conv_kernel_dim": 4,
    "linear_key_head_dim": 128,
    "linear_value_head_dim": 128,
    "linear_num_key_heads": 16,
    "linear_num_value_heads": 48,
    "pad_token_id": null,
    "bos_token_id": null,
    "eos_token_id": 248044,
    "rope_parameters": {
      "mrope_interleaved": true,
      "mrope_section": [11, 11, 10],
      "rope_type": "default",
      "rope_theta": 10000000,
      "partial_rotary_factor": 0.25
    },
    "layer_types": [
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention",
      "linear_attention", "linear_attention", "linear_attention", "full_attention"
    ]
  },
  "quantization_config": {
    "_comment": "Your quantization_config from modelopt export goes here unchanged. Example below.",
    "config_groups": {
      "group_0": {
        "input_activations": { "dynamic": false, "num_bits": 4, "type": "float", "group_size": 16 },
        "weights": { "dynamic": false, "num_bits": 4, "type": "float", "group_size": 16 },
        "targets": ["Linear"]
      }
    },
    "ignore": ["lm_head", "...your conv1d exclude list..."],
    "quant_algo": "NVFP4",
    "producer": { "name": "modelopt", "version": "0.42.0" },
    "quant_method": "modelopt"
  }
}
